<?php

class Config {

    const BOT_NAME = "magnit_promo_bot";
    const BOT_TOKEN = "1205712355:AAE3_QA5NWN2Ze-XE_MUE6Ew95GXBgPBwDQ";

    const HELP = "За помощью обращаться к администраторам";
    const ABOUT = "Бот создан командой разработчиков ANT DEV";
    const RULES = '
    Не надо покупать заранее, купили - спишите, пока действует гарантия!
     1. Возврат денежных средств.(На баланс аккаунта)
    1.1 Возврат денежных средств предусмотрен в случае:
    1.1.1 Не совпадения баллов при покупке аккаунта.
    1.1.2 Неудачных попыток списания баллов (Магнит - при условии что совершена покупка(отображается в истории))(если я не смогу посмотреть историю то замены не будет)
    1.2 Возврат денежных средств осуществляется исключительно на лицевой счет бота
     2. ГАРАНТИЯ
    2.1 Гарантия аккаунтов не распространяется на случаи, когда кассир говорит о каких-либо проблемах со связью непосредственно касающихся магазина.
    2.2 Гарантия на балансы до  1 час,
    2.3 Гарантия не распространяется на перепроданный товар с бота. (также если товар передан кому-то ещё)
     3. Пополнение
    3.1 Если вы произвели пополнение без комментария, администрация вправе не возмещать ваши денежные средства.
     4. Другое
    4.1 ⚠️ Вывод денежных средств с лицевого счета не осуществляется.
    4.2 Администрация оставляет за собой право вносить любые изменения и дополнения в ПРАВИЛА, без предупреждения!
    4.3 Администрация не ответственна, если в населенном пункте покупателя не работает программа лояльности.
     5. Обработка персональных данных
    5.1 Пользуясь ботом вы автоматически даете согласие на обработку персональных данных согласно Федеральному закону "О персональных данных" от 27.07.2006 N 152-ФЗ.
    -------------------------------------------------------------------------------
    Теперь поговорим о том как писать мне если у Вас проблемы с АШ.Пишем строго по форме...на сообщения привет и т.д я отвечать не буду(У меня нет столько времени для общения с каждым)
    1.Полностью описываем проблему(Если на штриху "Невозможно авторизоваться" пишем 1.Невозможно авторизоваться) (Не удалось списать АШ и т.д)
    2.Пересылаем сообщение с бота (то сообщение где он выдал АШ)
    Строго по этой форме Я дам Вам замену либо купон(в размере стоимости штриха)(активировать в разделе баланс).
    ----------------
    Если штрих на Вид рабочий и Вы уверенны что он не рабочий.(Я скину его в Паблик где любой другой человек сможет заюзать Ваш штрих)
    Пишем мне по форме.
    1.Проверка
    2.Пересылаем сообщение с бота (то сообщение где он выдал АШ)
    Если АШ проходит проверку я выдам Вам замену либо купон в размере стоимости штриха.
    -----------------------------------------------------
    Правила по шипу с WISH
    1. За постоянный флуд двум админам вы будете заблокированны, по скольку отвечает только один администратор
    2. Если шипер вам заказал всё скинул все доказательства что все прошло успешно, но после отменили заказ, то перезаказ минимум стоит - 70₽ в зависимости от товара.
    3. Если шипер вам не шипнул товар в течение 3-4 дней, значит к нему поступило много заказов и он в ближайшее время все сделает. За шип манибэков нет только перезаказать прайс выше.
    4. После успешного шипа вам выдаётся ордер и аккаунт их нужно хранить по скольку шиппер не зайдет и не узнает данные если вы их не сохраните, всю ответственность несёт покупатель.
    ';
}

?>
